#ifndef TMPL_MASTER_H
#define TMPL_MASTER_H
#include <cppcms/view.h>

namespace Data {
    //-------------------------------------------------------------------------------------
    // Dsc: Структура основной информации о странице
    //-------------------------------------------------------------------------------------
    struct infoPage {
        std::string     title;                         // титул страницы
        std::string     description;                   // описание страницы
        std::string     keywords;                      // ключевые слова страницы
        bool            is_signed = false;
        std::string	userName;
        //std::map<std::string,std::string> menuList;   // список выводимых пунктов меню (url,desc)
        
        
        
        //-------------------------------------------------------------------------------------
        // Dsc: Конструктор, инициализирующий переменные
        //-------------------------------------------------------------------------------------
        infoPage() :
        title      (""),
        description(""),
        keywords   (""),
        userName   ("")
        {}
        //-------------------------------------------------------------------------------------
        // Dsc: Деструктор, ничего не делающий
        //-------------------------------------------------------------------------------------
        ~infoPage(){}
    };
    //-------------------------------------------------------------------------------------
    // Dsc: Базовый контент который есть на каждой странице
    //-------------------------------------------------------------------------------------
    //extern "C" typedef MENUSTRUCT MenuStruct;

    struct Master :public cppcms::base_content {
        infoPage    page;
        int	user_level;
        int newMsgCount;
        std::string user_ref;
        std::string user_code;
        typedef struct _MENUSTRUCT{
            std::string url;
            std::string title;
            std::string style;
            std::string icon;
            std::string badge;
            std::vector<_MENUSTRUCT> menu;
        }MenuStruct;
        
        
        std::vector<MenuStruct> menuList;   // список выводимых пунктов меню (url,desc)
        
        
        std::string assetsUrl;
        //-------------------------------------------------------------------------------------
        // Dsc: Конструктор страницы
        //-------------------------------------------------------------------------------------
        Master() :
        page(),user_level(0),newMsgCount(0)
        {}
        //-------------------------------------------------------------------------------------
        // Dsc: Ленивый деструктор
        //-------------------------------------------------------------------------------------
        ~Master(){}
    };
}
#endif
